config updated
